
{{alias}}( x )
    Computes the secant of a number.

    Parameters
    ----------
    x: number
        Input value (in radians).

    Returns
    -------
    y: number
        Secant.

    Examples
    --------
    > var y = {{alias}}( 0.0 )
    ~1.0
    > y = {{alias}}( {{alias:@stdlib/constants/float64/pi}}/4.0 )
    ~1.4144
    > y = {{alias}}( -{{alias:@stdlib/constants/float64/pi}}/6.0 )
    ~1.1547
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------
